namespace Domain.Enums
{
    public enum WatermarkCode
    {
        /// <summary>
        /// Вз «1». Применялся в 1857 – 1858 гг. на марках РИ №№ 1, 2.
        /// </summary>
        v1,
        /// <summary>
        /// Вз «2». Применялся в 1858 г. на марке РИ № 3.
        /// </summary>
        v2,
        /// <summary>
        /// Вз «3». Применялся в 1858 г. на марке РИ № 4.
        /// </summary>
        v3,
        /// <summary>
        /// Вз «горизонтальное верже». Применялся с 1866 г.
        /// и буквы «ЭЗГБ» – Экспедиция заготовления государственных бумаг, на отдельную марку попадает одна буква, часть буквы или только узор
        /// </summary>
        VerzheHor,
        /// <summary>
        /// Вз «вертикальное верже». Применялся с 1868 г
        /// </summary>
        VerzheVer,
        /// <summary>
        /// Вз «шестиугольники». Применялся в 1879 г.
        /// </summary>
        Hexagon,
        /// <summary>
        /// Вз «теневые квадраты» (встречается в четырёх положениях). Применялся с 1921 г.
        /// </summary>
        ShadowSquare,
        /// <summary>
        /// Вз «горизонтальные ромбы». Применялся с 1922 г., на непочтовых марках – с конца XIX в.
        /// </summary>
        RhombusHor,
        /// <summary>
        /// Вз «вертикальные ромбы». Применялся с 1922 г., на непочтовых марках – с конца XIX в.
        /// </summary>
        RhombusVer,
        /// <summary>
        /// Вз «серп и молот». Применялся в 1950 г.
        /// </summary>
        HammerSickle,
        /// <summary>
        /// Вз «квадраты и углы». Применялся с конца 1920-х и в начале 1930-х гг.
        /// </summary>
        SquareCorner,
        /// <summary>
        /// Вз «ковёр» («меандр и цветок») горизонтальный. Применялся с 1925 г.
        /// </summary>
        CarpetHor,
        /// <summary>
        /// Вз «ковёр» вертикальный. Применялся с 1925 г.
        /// </summary>
        CarpetVer,
        /// <summary>
        /// Вз «углы». Применялся в 1960 г.
        /// </summary>
        Corner,
        /// <summary>
        /// Вз «плетёные линии». Встречается по краям марочных листов с 1908 г.
        /// </summary>
        BraidedLines,
        /// <summary>
        /// Вз «единицы». Встречается по краям марочных листов в 1933-38 гг.
        /// </summary>
        Ones,
        /// <summary>
        /// Меловая сетка горизонтальная. Применялась с 1919 г.
        /// </summary>
        ChalkMeshHor,
        /// <summary>
        /// Меловая сетка вертикальная. Применялась с 1908 г.
        /// </summary>
        ChalkMeshVer
    }
}
